update/sys_soap_message_function_79985d47dbeb3a0075ea38ff9d961989.xml

<?xml version="1.0" encoding="UTF-8"?>
<record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type>basic</authentication_type>
        <basic_auth_password/>
        <basic_auth_profile display_value="Oasis Web Service">bd275793db367a00d596327e9d9619e2</basic_auth_profile>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://www.delphi-tech.com/ows/PartyChangeService" xmlns:par1="http://www.delphi-tech.com/ows/Party">
	<soapenv:Header/>
	<soapenv:Body>
		<par:PartyChangeRequest>
			<par:UserId>${PartyChangeRequest.UserId}</par:UserId>
			<par1:Organization key="${PartyChangeRequest.Organization}">
				<par1:OrganizationNumberId>${Organization.OrganizationNumberId}</par1:OrganizationNumberId>
				<par1:PartyClassification key="${PartyClassification}">
					<par1:ClassificationNumberId>${PartyClassification.ClassificationNumberId}</par1:ClassificationNumberId>
					<par1:ClassificationCode>${PartyClassification.ClassificationCode}</par1:ClassificationCode>
					<par1:SubClassificationCode>${PartyClassification.SubClassificationCode}</par1:SubClassificationCode>
					<par1:SubTypeCode>${PartyClassification.SubTypeCode}</par1:SubTypeCode>
					<par1:EffectivePeriod>
						<par1:StartDate>${EffectivePeriod.StartDate}</par1:StartDate>
						<par1:EndDate>${EffectivePeriod.EndDate}</par1:EndDate>
					</par1:EffectivePeriod>
				</par1:PartyClassification>
			</par1:Organization>
			<par:DataModificationInformation>
				<par:ActionCode/>
				<par:PreviousDataValueDescription>
					<par1:Organization key="${PartyChangeRequest.Organization}">
						<par1:OrganizationNumberId>${Organization.OrganizationNumberId}</par1:OrganizationNumberId>
					</par1:Organization>
				</par:PreviousDataValueDescription>
			</par:DataModificationInformation>
		</par:PartyChangeRequest>
	</soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>insertOrganizationClassification</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>CAM-OASIS-PartyChangeService [ insertOrganizationClassification ]</qualified_name>
        <soap_action>partyChangeRequest</soap_action>
        <soap_endpoint>http://oas16eoadev.norcalmutual.com:8080/dev/eCIS/wsCIS/PartyChangeService</soap_endpoint>
        <soap_message display_value="CAM-OASIS-PartyChangeService">0db6d793db367a00d596327e9d961962</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>rrao</sys_created_by>
        <sys_created_on>2017-06-28 19:51:17</sys_created_on>
        <sys_customer_update>true</sys_customer_update>
        <sys_id>79985d47dbeb3a0075ea38ff9d961989</sys_id>
        <sys_mod_count>4</sys_mod_count>
        <sys_name>insertOrganizationClassification</sys_name>
        <sys_package display_value="Medical Claim Management" source="x_norca_med_cam">4427741adb53fe8023cdd92b5e961942</sys_package>
        <sys_policy/>
        <sys_replace_on_upgrade>false</sys_replace_on_upgrade>
        <sys_scope display_value="Medical Claim Management">4427741adb53fe8023cdd92b5e961942</sys_scope>
        <sys_update_name>sys_soap_message_function_79985d47dbeb3a0075ea38ff9d961989</sys_update_name>
        <sys_updated_by>rrao</sys_updated_by>
        <sys_updated_on>2017-07-17 20:36:27</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server display_value="">b755df81dbc04300d596327e9d961980</use_mid_server>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
